1m3_4mm_wall_H2_test_76/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);  

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    bottom_wall
    {
        type            noSlip;
    }
    top
    {
        type            zeroGradient;
    }
    nozzle_4mm_3mm_m
    {
        type            noSlip;
    }
    nozzle
    {
        // Ramp 0 → 303 m/s over 0.5 s (+z, upward from floor nozzle).
        // U = ṁ/(ρ·A) = 1.6339e-4 / (0.08583 × π/2×(2e-3)²) ≈ 303 m/s
        // ρ_H2 = 0.08583 kg/m³ at T=286.15 K, P=101325 Pa (experiment conditions)
        // k and epsilon tables in 0.orig/k and 0.orig/epsilon are synchronised
        // to this ramp (I=0.05, L=0.07×D=2.8e-4 m, D=4 mm nozzle).
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    (0 0 0))
            (0.5    (0 0 303))
            (1000.0  (0 0 303))
        );
        value           uniform (0 0 0);
    }
    box_shell_m  //wall
    {
        type            noSlip;
    }
}
// ************************************************************************* //
